Autodesk.Revit.DB.Analysis.EnergyAnalysisConstruction.GetMaterialIds
Returns a list of ids of the associated materials to analytical construction.
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisConstruction.Roughness
The roughness value of the construction.
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisConstruction.Absorptance
The absorptance value of the construction.
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisConstruction.ThermalMass
The thermal mass value (Cth-value) of the construction.
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisConstruction.ThermalResistance
The thermal resistance value (R-value) of the construction.
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisConstruction.HeatTransferCoefficient
The heat transfer coefficient value (U-value) of the construction.
Remarks:
A heat transfer coefficient measured in W/m^2K
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisConstruction.Description
The description of the construction.
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisConstruction.ConstructionName
The name of the construction
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisConstruction.IsSchematic
Indicates if this originates from a schematic or analytical construction.
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisConstruction
Represent an analytical construction as a composite of layered materials.
Since:
2024